Reports/ПланФактныйАнализБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ПланФактныйАнализБюджета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьОбособленныеПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательОтклонение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПревышение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательОстаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПлан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательФакт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательКодСтатьи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьОтчетПриИзмененииНастроек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделыОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>26</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьПоПериодам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПроцентИсполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьБыстрыеНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Documents/Бюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Бюджет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетРасходы</xr:Item>
				<xr:Item>InformationRegister.СтруктураБюджетаРасходы</xr:Item>
				<xr:Item>AccumulationRegister.БюджетДоходы</xr:Item>
				<xr:Item>InformationRegister.СтруктураБюджетаДоходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Детализация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПланирования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПланирования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасходыПоНаправлениямДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПланирования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураДоходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураРасходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ПланФактныйАнализБюджета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПланФактныйАнализБюджета");
	НастройкиВарианта.Описание = НСтр("ru = 'План-фактный анализ бюджета.'");
	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.БухгалтерияПредприятияПодсистемы.Подсистемы.Бюджет, "");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РасшифровкаПоказателей");
	НастройкиВарианта.Описание = НСтр("ru = 'План-фактный анализ бюджета (Расшифровка).'");
	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.БухгалтерияПредприятияПодсистемы.Подсистемы.Бюджет, "");
	
КонецПроцедуры

// Инициализирует набор параметров, задающих флаги выполнения дополнительных действий над сущностями, обрабатываемыми
// в процессе формирования отчета.
//
// Возвращаемое значение:
//   Структура   - флаги, задающие необходимость дополнительных действий.
//
Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИспользоватьПередКомпоновкойМакета",          Истина);
	Результат.Вставить("ИспользоватьПослеКомпоновкиМакета",           Ложь);
	Результат.Вставить("ИспользоватьПослеВыводаРезультата",           Истина);
	Результат.Вставить("ИспользоватьДанныеРасшифровки",               Истина);
	Результат.Вставить("ИспользоватьРасширенныеПараметрыРасшифровки", Истина);
	Результат.Вставить("ИспользоватьПриВыводеЗаголовка",              Ложь);
	Результат.Вставить("ИспользоватьПриВыводеПодвала",                Истина);
	
	Возврат Результат;
	
КонецФункции

// Формирует текст, выводимый в заголовке отчета.
//
// Параметры:
//  ПараметрыОтчета - Структура - см. ПодготовитьПараметрыОтчета() в ФормаОтчета.
//
// Возвращаемое значение:
//   Строка      - текст заголовка с учетом периода.
//
Функция ПолучитьТекстЗаголовка(ПараметрыОтчета) Экспорт 
	
	ЗаголовокОтчета = НСтр("ru='%1 за %2'");
	Если ПараметрыОтчета.РежимРасшифровки Тогда
		Название = НСтр("ru='План-фактный анализ бюджета (Расшифровка)'");
	Иначе
		Название = НСтр("ru='План-фактный анализ бюджета'");
	КонецЕсли;
	
	Если ПараметрыОтчета.ГруппироватьПоПериодам Тогда
		Период = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(ПараметрыОтчета.НачалоПериода,
			ПараметрыОтчета.КонецПериода, Истина);
	Иначе
		Период = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериодаСНачалаГода(
			ПараметрыОтчета.КонецПериода, ПараметрыОтчета.ПоМесяцам, Истина);
	КонецЕсли;
		
	ЗаголовокОтчета = СтрШаблон(ЗаголовокОтчета, Название, Период);
	
	Возврат ЗаголовокОтчета;
	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Организация",  ПараметрыОтчета.Организация);
		
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "НачалоПериода", НачалоДня(ПараметрыОтчета.НачалоПериода));
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "КонецПериода", КонецДня(ПараметрыОтчета.КонецПериода));
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "ОстатокНаНачалоГодаПлан", ПараметрыОтчета.ОстатокНаНачало);
		
	ОстаткиДенежныхСредств = Отчеты.ОстаткиДенежныхСредств.ПолучитьОстаткиДенежныхСредствДляМонитораРуководителяСводно(ПараметрыОтчета.Организация, 
		НачалоДня(ПараметрыОтчета.НачалоПериода) - 1);
		
	ОстатокНаНачалоГодаФакт = ОстаткиДенежныхСредств.Итог("Сумма");
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "ОстатокНаНачалоГодаФакт", ОстатокНаНачалоГодаФакт);
		
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "ПоМесяцам", ПараметрыОтчета.ПоМесяцам);
		
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек, "ГруппироватьПоПериодам", ПараметрыОтчета.ГруппироватьПоПериодам);
		
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	
	Если ПараметрыОтчета.ПоказательКодСтатьи Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(НастройкиКомпоновки.Выбор, "КодСтатьи");
	КонецЕсли;
	Если ПараметрыОтчета.ПоказательПлан Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(НастройкиКомпоновки.Выбор, "План");
	КонецЕсли;
	Если ПараметрыОтчета.ПоказательФакт Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(НастройкиКомпоновки.Выбор, "Факт");
	КонецЕсли;
	Если ПараметрыОтчета.ПоказательОстаток Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(НастройкиКомпоновки.Выбор, "Остаток");
	КонецЕсли;
	Если ПараметрыОтчета.ПоказательПревышение Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(НастройкиКомпоновки.Выбор, "Превышение");
	КонецЕсли;
	Если ПараметрыОтчета.ПоказательОтклонение Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(НастройкиКомпоновки.Выбор, "Отклонение");
	КонецЕсли;
	Если ПараметрыОтчета.ПоказательПроцентИсполнения Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(НастройкиКомпоновки.Выбор, "ПроцентИсполнения");
	КонецЕсли;
	
	БухгалтерскиеОтчетыВызовСервера.ДобавитьОтборПоОрганизации(ПараметрыОтчета, КомпоновщикНастроек);
	
	Если Не ПараметрыОтчета.РежимРасшифровки Тогда
		НастроитьГруппировкиДляОтчета(ПараметрыОтчета, НастройкиКомпоновки);
	Иначе
		НастроитьГруппировкиДляРасшифровкиОтчета(ПараметрыОтчета, НастройкиКомпоновки);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура НастроитьГруппировкиДляОтчета(ПараметрыОтчета, НастройкиКомпоновки)
	
	ИмяГруппировки = ПараметрыОтчета.РазделыОтчета;
	
	Если ПараметрыОтчета.ГруппироватьПоПериодам Тогда
		ИмяГруппировки = СтрШаблон("%1ПоПериодам", ИмяГруппировки);
	КонецЕсли;
	
	ВыбраннаяГруппировка = ГруппировкаОтчетаПоИмени(НастройкиКомпоновки.Структура, ИмяГруппировки);
	ВыбраннаяГруппировка.Использование = Истина;
	
КонецПроцедуры

Процедура НастроитьГруппировкиДляРасшифровкиОтчета(ПараметрыОтчета, НастройкиКомпоновки)
	
	ГруппировкаПоУмолчанию = ГруппировкаОтчетаПоИмени(НастройкиКомпоновки.Структура, "БезДопГруппировок");
	
	НастройкиКомпоновки.Структура.Очистить();
	Группировка = НастройкиКомпоновки.Структура;
	Для Каждого ПолеВыбраннойГруппировки Из ПараметрыОтчета.Группировка Цикл 
		Если ПолеВыбраннойГруппировки.Использование Тогда
			Если ТипЗнч(Группировка) = Тип("КоллекцияЭлементовСтруктурыНастроекКомпоновкиДанных") Тогда
				Группировка = Группировка.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			Иначе
				Группировка = Группировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			КонецЕсли;
			БухгалтерскиеОтчетыВызовСервера.ЗаполнитьГруппировку(ПолеВыбраннойГруппировки, Группировка);
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(Группировка) = Тип("КоллекцияЭлементовСтруктурыНастроекКомпоновкиДанных") Тогда
		Группировка = Группировка.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Иначе
		Группировка = Группировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Группировка, ГруппировкаПоУмолчанию);
	Для Каждого ПолеГруппировкиПоУмолчанию Из ГруппировкаПоУмолчанию.ПоляГруппировки.Элементы Цикл
		БухгалтерскиеОтчетыВызовСервера.ЗаполнитьГруппировку(ПолеГруппировкиПоУмолчанию, Группировка);
	КонецЦикла;
	
КонецПроцедуры

Функция ГруппировкаОтчетаПоИмени(СтруктураНастроек, ИмяГруппировки)
	
	Для Каждого ЭлементНастроек Из СтруктураНастроек Цикл
		Если (ТипЗнч(ЭлементНастроек) = Тип("ГруппировкаКомпоновкиДанных")
			Или ТипЗнч(ЭлементНастроек) = Тип("ТаблицаКомпоновкиДанных")
			Или ТипЗнч(ЭлементНастроек) = Тип("ГруппировкаТаблицыКомпоновкиДанных"))
			И ЭлементНастроек.Имя = ИмяГруппировки Тогда
			Возврат ЭлементНастроек;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Обработчик вывода подвала отчета.
//
// Параметры:
//	ПараметрыОтчета - Структура - Содержит ключи:
//		* Организация - СправочникСсылка.Организации - Организация, по которой формируется отчет.
//		* Период - Дата - Период формирования отчета (опционально).
//		* КонецПериода - Дата - Конец периода формирования отчета (опционально).
//	Результат - ТабличныйДокумент - Результат формирования отчета.
//
Процедура ПриВыводеПодвала(ПараметрыОтчета, Результат) Экспорт
	
	Макет = Отчеты.ПланФактныйАнализБюджета.ПолучитьМакет("МакетОтчета");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подписи");
	ОбластьПодвал.Параметры.Заполнить(Новый Структура("ТекущаяДата", ТекущаяДатаСеанса()));
	
	ДанныеОтветственного = БухгалтерскиеОтчетыВызовСервера.ПолучитьДанныеОтветственногоЛица(ПараметрыОтчета);
	ОбластьПодвал.Параметры.Заполнить(ДанныеОтветственного);
	
	Результат.Вывести(ОбластьПодвал);
	
КонецПроцедуры

// В процедуре можно изменить табличный документ после вывода в него данных.
//
// Параметры:
//  ПараметрыОтчета - Структура - см. ПодготовитьПараметрыОтчета() в ФормаОтчета.
//  Результат    - ТабличныйДокумент - сформированный отчет.
//
Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаРезультатаОтчета(ПараметрыОтчета.ИдентификаторОтчета, Результат);
	
	БыстрыеНастройкиОтчетовСервер.ВывестиПримечанияОкругления(ПараметрыОтчета, Результат);
	
КонецПроцедуры

// Заполняет настройки расшифровки
//
// Параметры:
//  Адрес					- Строка, адрес с данными отчета во временном хранилище.
//  Расшифровка 			- ИдентификаторРасшифровкиКомпоновкиДанных, идентификатор расшифровки из ячейки для которой вызвана расшифровка.
//  ПараметрыРасшифровки	- Структура, настройки расшифровки отчета, которые нужно заполнить.
//
Процедура ЗаполнитьПараметрыРасшифровкиОтчета(Адрес, Расшифровка, ПараметрыРасшифровки) Экспорт
	
	ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	ПользовательскиеОтборы = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
	ПользовательскиеОтборы.ИдентификаторПользовательскойНастройки = "Отбор";
	
	ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
	
	ДанныеОбъекта = ПолучитьИзВременногоХранилища(Адрес);
	
	ОтчетОбъект       = ДанныеОбъекта.Объект;
	ДанныеРасшифровки = ДанныеОбъекта.ДанныеРасшифровки;
	РежимРасшифровки  = ОтчетОбъект.РежимРасшифровки;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(ДанныеРасшифровки.Настройки);
	КомпоновщикНастроек.Инициализировать(
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(ДанныеОбъекта.Объект.СхемаКомпоновкиДанных));
		
	СоответствиеПолей = Новый Соответствие;
	
	Если Не РежимРасшифровки Тогда
		ДополнительныеСвойства.Вставить("РежимРасшифровки", Истина);
		ДополнительныеСвойства.Вставить("Организация"     , ОтчетОбъект.Организация);
	
		СоответствиеПолей.Вставить("СтатьяДохода");
		СоответствиеПолей.Вставить("НаправлениеДеятельности");
		СоответствиеПолей.Вставить("СтатьяРасхода");
		СоответствиеПолей.Вставить("ТипЗаписи");
		
		// Отчет поддерживает расшифровку только этих полей
		МассивРасшифровываемыхПолей = СтрРазделить("План,Факт", ",");
	Иначе
		// Если отчет уже в режиме расшифровки - то при открытии суммы или даты открываем первичный документ
		СоответствиеПолей.Вставить("Документ");
		МассивРасшифровываемыхПолей = СтрРазделить("СуммаДокумента,ДатаРасшифровки", ",");
	КонецЕсли;
	
	МассивПолей = БухгалтерскиеОтчетыВызовСервера.ПолучитьМассивПолейРасшифровки(
		Расшифровка, ДанныеРасшифровки, КомпоновщикНастроек, Истина);
		
	Для Каждого ПолеРасшифровки Из МассивПолей Цикл
		
		Если ТипЗнч(ПолеРасшифровки) <> Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПолеРасшифровки.Поле = "Период" Тогда
			СоответствиеПолей.Вставить("Период");
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	РазобранныеДанныеРасшифровки = БухгалтерскиеОтчеты.ПолучитьДанныеРасшифровки(
		ДанныеРасшифровки, СоответствиеПолей, Расшифровка);
		
	Для Каждого Отбор Из МассивПолей Цикл
			
		Если ТипЗнч(Отбор) <> Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если МассивРасшифровываемыхПолей.Найти(Отбор.Поле) <> Неопределено Тогда
			ДобавитьПараметрыРасшифровки(Отбор.Поле, ОтчетОбъект, РазобранныеДанныеРасшифровки, ПараметрыРасшифровки);
			Прервать;
		ИначеЕсли Отбор.Значение = NULL Тогда
			Прервать;
		Иначе
			Если ЗначениеЗаполнено(Отбор.Значение) Тогда
				ПараметрыРасшифровки.Вставить("Значение",      Отбор.Значение);
				ПараметрыРасшифровки.Вставить("ОткрытьОбъект", Истина);
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает набор показателей отчета.
// Возвращаемое значение:
//   НаборПоказателей - Массив.
Функция ПолучитьНаборПоказателей() Экспорт
	
	НаборПоказателей = Новый Массив;
	
	НаборПоказателей.Добавить("План");
	НаборПоказателей.Добавить("Факт");
	НаборПоказателей.Добавить("Отклонение");
	НаборПоказателей.Добавить("Остаток");
	НаборПоказателей.Добавить("Превышение");
	НаборПоказателей.Добавить("КодСтатьи");
	
	Возврат НаборПоказателей;
	
КонецФункции

// Адаптирует переданные настройки для данного вида отчетов.
// Перед применением настроек расшифровки может возникнуть необходимость учесть особенности этого вида отчетов.
//
// Параметры:
//  Настройки	 - Структура - Настройки которые нужно адаптировать (см. БухгалтерскиеОтчетыКлиентСервер.НовыйУниверсальныеНастройки).
//
Процедура АдаптироватьНастройки(Настройки) Экспорт
	
	// Удалим автоотступ из условного оформления.
	БухгалтерскиеОтчеты.УдалитьАвтоотступИзУсловногоОформления(Настройки.УсловноеОформление);
	
КонецПроцедуры

// Возвращает идентификатор раздела отчета "Остаток на начало"
//
// Возвращаемое значение:
//   Число
//
Функция ТипЗаписиОстатокНаНачало() Экспорт
	Возврат 1;
КонецФункции

// Возвращает идентификатор раздела отчета "Финансирование"
//
// Возвращаемое значение:
//   Число
//
Функция ТипЗаписиДоход() Экспорт
	Возврат 2;
КонецФункции

// Возвращает идентификатор раздела отчета "Расходы"
//
// Возвращаемое значение:
//   Число
//
Функция ТипЗаписиРасход() Экспорт
	Возврат 3;
КонецФункции

// Возвращает идентификатор раздела отчета "Остаток на конец"
//
// Возвращаемое значение:
//   Число
//
Функция ТипЗаписиОстатокНаКонец() Экспорт
	Возврат 4;
КонецФункции

#КонецОбласти

#Область СлужебныeПроцедурыИФункции

Процедура ДобавитьПараметрыРасшифровки(ИмяПоля, ОтчетОбъект, РазобранныеДанныеРасшифровки, ПараметрыРасшифровки)
	
	Если ОтчетОбъект.РежимРасшифровки Тогда
		// Если отчет уже в режиме расшифровки - то при открытии суммы или даты открываем первичный документ
		Если ЗначениеЗаполнено(РазобранныеДанныеРасшифровки["Документ"]) Тогда
			ПараметрыРасшифровки.Вставить("Значение",      РазобранныеДанныеРасшифровки["Документ"]);
			ПараметрыРасшифровки.Вставить("ОткрытьОбъект", Истина);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ИмяПоля <> "План" И ИмяПоля <> "Факт" Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяПоля = "План" Тогда
		ДобавитьПараметрыРасшифровкиПлана(ИмяПоля, ОтчетОбъект, РазобранныеДанныеРасшифровки, ПараметрыРасшифровки);
	ИначеЕсли ИмяПоля = "Факт" Тогда
		ДобавитьПараметрыРасшифровкиФакта(ИмяПоля, ОтчетОбъект, РазобранныеДанныеРасшифровки, ПараметрыРасшифровки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПараметрыРасшифровкиПлана(ИмяПоля, ОтчетОбъект, РазобранныеДанныеРасшифровки, ПараметрыРасшифровки)
	
	ПараметрыФормы = Новый Структура;
	БюджетОрганизации = Документы.Бюджет.БюджетНаПериод(ОтчетОбъект.Организация, ОтчетОбъект.НачалоПериода);
	ПоследняяКорректировка = Документы.КорректировкаБюджета.ПоследняяКорректировка(БюджетОрганизации);
	
	ИмяФормы = "Обработка.Бюджет.Форма";
	Если ТипЗнч(ПоследняяКорректировка) = Тип("ДокументСсылка.КорректировкаБюджета") Тогда
		ИмяФормы = "Обработка.КорректировкаБюджета.Форма";
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ДокументСсылка", ПоследняяКорректировка);
	
	ПараметрыПоискаСтроки = Новый Структура;
	ПараметрыПоискаСтроки.Вставить("ПериодДетализации", ОтчетОбъект.КонецПериода);
	Если ЗначениеЗаполнено(РазобранныеДанныеРасшифровки["Период"]) Тогда
		ПараметрыПоискаСтроки.ПериодДетализации = РазобранныеДанныеРасшифровки["Период"];
		Если Не ОтчетОбъект.ПоМесяцам Тогда
			ПараметрыПоискаСтроки.ПериодДетализации = ДобавитьМесяц(ПараметрыПоискаСтроки.ПериодДетализации, 2);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыПоискаСтроки.Вставить("ТипЗаписи", РазобранныеДанныеРасшифровки["ТипЗаписи"]);
	ПараметрыПоискаСтроки.Вставить("НаправлениеДеятельности", Справочники.НаправленияДеятельности.ПустаяСсылка());
	ПараметрыПоискаСтроки.Вставить("СтатьяДДС", Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
	
	Если РазобранныеДанныеРасшифровки["ТипЗаписи"] = ТипЗаписиДоход() Тогда
		Если ЗначениеЗаполнено(РазобранныеДанныеРасшифровки["СтатьяДохода"]) Тогда
			ПараметрыПоискаСтроки.СтатьяДДС = РазобранныеДанныеРасшифровки["СтатьяДохода"];
		КонецЕсли;
	ИначеЕсли РазобранныеДанныеРасшифровки["ТипЗаписи"] = ТипЗаписиРасход() Тогда
		Если ЗначениеЗаполнено(РазобранныеДанныеРасшифровки["НаправлениеДеятельности"]) Тогда
			ПараметрыПоискаСтроки.НаправлениеДеятельности = РазобранныеДанныеРасшифровки["НаправлениеДеятельности"];
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РазобранныеДанныеРасшифровки["СтатьяРасхода"]) Тогда
			ПараметрыПоискаСтроки.СтатьяДДС = РазобранныеДанныеРасшифровки["СтатьяРасхода"];
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ПараметрыПоискаСтроки", ПараметрыПоискаСтроки);
	
	ПараметрыРасшифровки.Вставить("ОткрытьОбъект",  Ложь);
	ПараметрыРасшифровки.Вставить("ОткрытьФорму",   Истина);
	ПараметрыРасшифровки.Вставить("Форма",          ИмяФормы);
	ПараметрыРасшифровки.Вставить("ПараметрыФормы", ПараметрыФормы);
	
КонецПроцедуры

Процедура ДобавитьПараметрыРасшифровкиФакта(ИмяПоля, ОтчетОбъект, РазобранныеДанныеРасшифровки, ПараметрыРасшифровки)
	
	УниверсальныеНастройки = БухгалтерскиеОтчетыКлиентСервер.НовыйУниверсальныеНастройки();
	ЗаполнитьЗначенияСвойств(УниверсальныеНастройки, ОтчетОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация",            ОтчетОбъект.Организация);
	ПараметрыФормы.Вставить("РежимРасшифровки",       Истина);
	ПараметрыФормы.Вставить("ОткрытьРасшифровку",     Истина);
	
	НачалоПериода = ОтчетОбъект.НачалоПериода;
	КонецПериода = ОтчетОбъект.КонецПериода;
	
	ИмяФормы = "Отчет.ПланФактныйАнализБюджета.ФормаОбъекта";
	
	Если РазобранныеДанныеРасшифровки["ТипЗаписи"] = ТипЗаписиОстатокНаНачало() Тогда
		// Это расшифровка факта по остаткам денежных средств на начало периода
		ИмяФормы = "Отчет.ОстаткиДенежныхСредств.ФормаОбъекта";
		НачалоПериода = НачалоГода(НачалоПериода) - 1;
		
	ИначеЕсли РазобранныеДанныеРасшифровки["ТипЗаписи"] = ТипЗаписиДоход() Тогда
		// Это расшифровка факта по доходам
		ДобавитьОтборВРасшифровку(
			УниверсальныеНастройки.НастройкиКомпоновки,
			РазобранныеДанныеРасшифровки,
			"СтатьяДохода",
			"СтатьяДвиженияДенежныхСредств");
		
	ИначеЕсли РазобранныеДанныеРасшифровки["ТипЗаписи"] = ТипЗаписиРасход() Тогда
		// Это расшифровка факта по расходам
		ДобавитьОтборВРасшифровку(
			УниверсальныеНастройки.НастройкиКомпоновки,
			РазобранныеДанныеРасшифровки,
			"НаправлениеДеятельности",
			"НаправлениеДеятельностиРасхода");
		
		ДобавитьОтборВРасшифровку(
			УниверсальныеНастройки.НастройкиКомпоновки,
			РазобранныеДанныеРасшифровки,
			"СтатьяРасхода",
			"СтатьяДвиженияДенежныхСредств");
			
	ИначеЕсли РазобранныеДанныеРасшифровки["ТипЗаписи"] = ТипЗаписиОстатокНаКонец() Тогда
		// Это расшифровка факта по остаткам денежных средств на конец периода
		ИмяФормы = "Отчет.ОстаткиДенежныхСредств.ФормаОбъекта";
		НачалоПериода = ОтчетОбъект.КонецПериода;
	Иначе
		// Другие расшифровки не поддерживаются
		Возврат;
		
	КонецЕсли;
	
	Если ОтчетОбъект.ГруппироватьПоПериодам 
		И РазобранныеДанныеРасшифровки["Период"] <> Неопределено Тогда
		УстановитьПериодРасшифровки(НачалоПериода, КонецПериода, РазобранныеДанныеРасшифровки["ТипЗаписи"], РазобранныеДанныеРасшифровки["Период"], ОтчетОбъект.ПоМесяцам);
	КонецЕсли;
	
	Если ИмяФормы = "Отчет.ПланФактныйАнализБюджета.ФормаОбъекта" Тогда
		
		ДобавитьОтборВРасшифровку(
			УниверсальныеНастройки.НастройкиКомпоновки,
			РазобранныеДанныеРасшифровки,
			"ТипЗаписи",
			"ТипРасшифровки");
		
		УниверсальныеНастройки.КлючВарианта = "РасшифровкаПоказателей";
		
	КонецЕсли;
	
	УниверсальныеНастройки.Вставить("НачалоПериода", НачалоПериода);
	УниверсальныеНастройки.Вставить("КонецПериода", КонецПериода);
	
	ПараметрыФормы.Вставить("УниверсальныеНастройки",  УниверсальныеНастройки);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ПараметрыРасшифровки.Вставить("ОткрытьОбъект",  Ложь);
	ПараметрыРасшифровки.Вставить("ОткрытьФорму",   Истина);
	ПараметрыРасшифровки.Вставить("Форма",          ИмяФормы);
	ПараметрыРасшифровки.Вставить("Уникальность",   Новый УникальныйИдентификатор);
	ПараметрыРасшифровки.Вставить("ПараметрыФормы", ПараметрыФормы);
	
КонецПроцедуры

Процедура ДобавитьОтборВРасшифровку(НастройкиКомпоновки, РазобранныеДанныеРасшифровки, ПолеРасшифровки, ПолеКомпоновки)
	
	ДобавлятьОтбор = Истина;
	
	Если ЗначениеЗаполнено(РазобранныеДанныеРасшифровки[ПолеРасшифровки]) Тогда
		ЗначениеРасшифровки = РазобранныеДанныеРасшифровки[ПолеРасшифровки];
		Если ПолеРасшифровки <> "ТипЗаписи" Тогда
			ЭтоГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеРасшифровки, "ЭтоГруппа");
			ВидСравненияРасшифровки = ?(ЭтоГруппа, 
				ВидСравненияКомпоновкиДанных.ВИерархии,
				ВидСравненияКомпоновкиДанных.Равно);
		Иначе
			ВидСравненияРасшифровки = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
			
	ИначеЕсли РазобранныеДанныеРасшифровки[ПолеРасшифровки] <> Неопределено Тогда
		ЗначениеРасшифровки = Неопределено;
		ВидСравненияРасшифровки = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
	Иначе
		ДобавлятьОтбор = Ложь;
		
	КонецЕсли;
	
	Если ДобавлятьОтбор Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
			НастройкиКомпоновки,
			ПолеКомпоновки,
			ЗначениеРасшифровки,
			ВидСравненияРасшифровки);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПериодРасшифровки(НачалоПериода, КонецПериода, ТипЗаписи, ПериодРасшифровки, ПоМесяцам)
	
	Если ТипЗаписи = ТипЗаписиОстатокНаНачало() Тогда
		// Это расшифровка факта по остаткам денежных средств на начало периода
		Если ПоМесяцам Тогда
			НачалоПериода = НачалоМесяца(ПериодРасшифровки) - 1;
			КонецПериода = НачалоМесяца(ПериодРасшифровки);
		Иначе
			НачалоПериода = НачалоКвартала(ПериодРасшифровки) - 1;
			КонецПериода = НачалоКвартала(ПериодРасшифровки);
		КонецЕсли;
		
	ИначеЕсли ТипЗаписи = ТипЗаписиДоход() Или ТипЗаписи = ТипЗаписиРасход() Тогда
		// Это расшифровка факта по доходам или расходам
		Если ПоМесяцам Тогда
			НачалоПериода = НачалоМесяца(ПериодРасшифровки);
			КонецПериода = КонецМесяца(ПериодРасшифровки);
		Иначе
			НачалоПериода = НачалоКвартала(ПериодРасшифровки);
			КонецПериода = КонецКвартала(ПериодРасшифровки);
		КонецЕсли;
		
	ИначеЕсли ТипЗаписи = ТипЗаписиОстатокНаКонец() Тогда
		// Это расшифровка факта по остаткам денежных средств на конец периода
		Если ПоМесяцам Тогда
			НачалоПериода = КонецМесяца(ПериодРасшифровки);
			КонецПериода = КонецМесяца(ПериодРасшифровки);
		Иначе
			НачалоПериода = КонецКвартала(ПериодРасшифровки);
			КонецПериода = КонецКвартала(ПериодРасшифровки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
